<!DOCTYPE html>
<!--[if lt IE 8 ]><html class="no-js ie ie7" lang="en"> <![endif]-->
<!--[if IE 8 ]><html class="no-js ie ie8" lang="en"> <![endif]-->
<!--[if IE 9 ]><html class="no-js ie ie9" lang="en"> <![endif]-->
<!--[if (gte IE 8)|!(IE)]><!--><html class="no-js" lang="en"> <!--<![endif]-->
<head>

   <!--- Basic Page Needs
   ================================================== -->
   <meta charset="utf-8">
   <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
   <title>DESCRICAO </title>
   <meta name="description" content="">  
   <meta name="author" content="">
   <script src="js/modernizr.js"></script>
   <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
   <script src="bootstrap.js"></script>
   <link rel="stylesheet" href="bootstrap.css">
   <link rel="stylesheet" href="layout.css">

   <script src="angular.js"></script>
   <script src="app.js"></script>


</head>
<body ng-app="app" ng-controller="PanelController as panel">
   <div id="wrapper">	
      <header>

         
        
      <nav class="navbar navbar-default navbar-fixed-top">
        <div class="container-fluid">
          <!-- Brand and toggle get grouped for better mobile display -->
          <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
              <span class="sr-only">Toggle navigation</span>
              <span class="icon-bar"></span>
              <span class="icon-bar"></span>
              <span class="icon-bar"></span>
            </button>
          </div>

          <!-- Collect the nav links, forms, and other content for toggling -->
          <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav nav-justified">
            
                              <li><a ng-click="panel.selectTab(1)" data-toggle="collapse"><a href="https://www.dimap.ufrn.br/dimap30anos">Voltar</a></li>

<!--
                  <li><a ng-click="panel.selectTab(1)" data-toggle="collapse"><a href="https://www.dimap.ufrn.br/dimap30anos">Início</a></li>
                  <li><a ng-click="panel.selectTab(2)"><a href="https://www.dimap.ufrn.br/dimap30anos">Comitês</a></li>
                  <li><a ng-click="panel.selectTab(3)"><a href="https://www.dimap.ufrn.br/dimap30anos">Chamada de Trabalhos</a></li>
                  <li><a ng-click="panel.selectTab(4)"><a href="https://www.dimap.ufrn.br/dimap30anos">Submissão</a></li>
                  <li><a ng-click="panel.selectTab(5)"><a href="https://www.dimap.ufrn.br/dimap30anos">Programação</a></li>
                  <li><a ng-click="panel.selectTab(6)"><a href="https://www.dimap.ufrn.br/dimap30anos">Inscrição</a></li>
                  <li><a ng-click="panel.selectTab(7)"><a href="https://www.dimap.ufrn.br/dimap30anos">Local</a></li>
                  <li><a ng-click="panel.selectTab(8)"><a href="https://www.dimap.ufrn.br/dimap30anos">Apoio</a></li>
                  <li><a href="http://www.dimap.ufrn.br">DIMAp</a></li>-->


            </ul>
          </div><!-- /.navbar-collapse -->
        </div><!-- /.container-fluid -->
      </nav>
         

      </header> <!-- Header End -->
      <div class="banner container">          
               <img class="img-responsive" src='img/ban_1100X275.png' align="middle">      
      </div>
 </body>     
<body ng-app="app" ng-controller="PanelController as panel">
   <div id="wrapper">	
      <div id="cardboard" class="container"> 

<!-- Descri&ccedil;&atilde;o -->
	<div id="body-text">
		<h1> Tutorial 1</h1>
        <h2>Machine-Oriented Reasoning</h2>
        <p id="paragrafo">Ministrante: Professora Claudia Nalon</p>
		<p id="paragrafo">In 1965, John A. Robinson published the paper "A Machine-Oriented Logic Based on the Resolution Principle'', launching the basis for automated deduction as we now know it. The resolution principle combines unification on demand together with a cut-elimination rule, building on the theoretical works by Prawitz and Herbrand and also improving on previous automated heuristics for proof search developed by Davis-Putnam. The result is an elegant, easy to implement, sound, and complete proof procedure with only one inference rule for dealing with validity in First-Order logic. In this tutorial, we celebrate the 50th anniversary of Robinson's foundational work by looking at the theory behind resolution-based systems for classical logics (propositional and first-order), the main results concerning the theoretical and practical development of such systems, and the state-of-the-art heuristics that make of this proof procedure one of the most widely implemented and successful tools for Automated Reasoning.</p>
		<p id="paragrafo"><b>Claudia Nalon</b> possui gradua&ccedil;&atilde;o em Ci&ecirc;ncia da Computa&ccedil;&atilde;o pela Universidade de Bras&iacute;lia (1993), mestrado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o pela Universidade Estadual de Campinas (1997) e doutorado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o pela University of Liverpool (2004). Atualmente &eacute; professora adjunta da Universidade de Bras&iacute;lia, tendo atuado como Coordenadora de Gradua&ccedil;&atilde;o do Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o e como Coordenadora de Extens&atilde;o do Instituto de Ci&ecirc;ncias Exatas. Atua na &aacute;rea de Teoria da Computa&ccedil;&atilde;o, com interesse, principalmente, em m&eacute;todos de prova baseados em resolu&ccedil;&atilde;o para combina&ccedil;&otilde;es de l&oacute;gicas n&atilde;o-cl&aacute;ssicas</p>

		<h1> Tutorial 2</h1>				  
        <h2>Plataformas para a Internet das Coisas</h2>
        <p id="paragrafo">Autores do minicurso: Paulo F. Pires (UFRJ), Flavia C. Delicato (UFRJ), Thais Batista (UFRN), Thomaz Barros (UFRJ), Everton Cavalcante (UFRN) e Marcelo Pitanga (UFRJ)</p>
        <p id="paragrafo">Ministrantes: Everton Cavalcante e Thais Batista</p>
        <p id="paragrafo">A Internet das Coisas (IoT) &eacute; um paradigma no qual objetos inteligentes colaboram de forma ativa com outros objetos f&iacute;sicos e virtuais dispon&iacute;veis na 
        Internet. Ambientes de IoT s&atilde;o caracterizados por um alto grau de heterogeneidade de dispositivos e protocolos de rede. Para tratar tal heterogeneidade, v&aacute;rias plataformas
         de middleware para IoT t&ecirc;m sido propostas visando abstrair as especificidades de tais dispositivos para aplica&ccedil;&otilde;es e usu&aacute;rios finais, bem como promover 
         interoperabilidade entre eles. Entretanto, a falta de padronizaç&atilde;o existente em IoT faz com que tais plataformas adotem diferentes modelos de programa&ccedil;&atilde;o e n&atilde;o abordem 
         adequadamente uma s&eacute;rie de requisitos importantes nesse contexto. Dessa forma, arquiteturas de refer&ecirc;ncia (ARs) s&atilde;o capazes de definir um conjunto inicial de blocos de 
         construç&atilde;o para ambientes de IoT e fornecer uma base sólida para alavancar sua ampla adoç&atilde;o. Tendo em vista a relevância de plataformas de middleware e arquiteturas de 
         refer&ecirc;ncia em IoT, bem como os desafios e oportunidades de pesquisa existentes, este tutorial tem por objetivos: (i) levantar e discutir requisitos de middleware para 
         IoT; (ii) apresentar ARs e plataformas de middleware para IoT existentes; e (iii) demonstrar o uso prático de uma plataforma de IoT. </p>
         <p id="paragrafo">Thais Batista &eacute; professora associada do DIMAp/UFRN e  bolsista de produtividade em pesquisa do CNPq. Atua nas &aacute;reas de Engenharia de 
         Software e Sistemas Distribu&iacute;dos. Seus interesses de pesquisa incluem Arquitetura de Software, Computa&ccedil;&atilde;o em Nuvem, Internet das Coisas. Middleware,
         entre outras. Orientou cerca de 25 disserta&ccedil;&otilde;es de mestrado e 6 teses de doutorado, j&aacute; conclu&iacute;das. &Eacute; co-autora de mais de 160 artigos 
         publicados em confer&ecirc;ncias e peri&oacute;dicos.</p>
		<p id="paragrafo">Everton Cavalcante &eacute; aluno de doutorado do PPgSC/UFRN desde 2013. Atua nas &aacute;reas de Engenharia de Software e Sistemas Distribu&iacute;dos.
		 Seus interesses de pesquisa incluem Arquitetura de Software, Computação em Nuvem, Internet das Coisas. Middleware, entre outras. &Eacute; co-autor de mais de 30 artigos 
		 publicados em confer&ecirc;ncias e peri&oacute;dicos.</p>
		 
		<h1> Tutorial 3</h1>				  
        <h2>Introdu&ccedil;&atilde;o a Arduino</h2>
        <p id="paragrafo">Ministrantes: Gabriel Vasiljevic e Wanderson Ricardo de Medeiros</p>
		<UL TYPE="circle">
		<LI>O que &eacute; o Arduino (especifica&ccedil;&otilde;es, modelos, aplica&ccedil;&otilde;es)</LI>
		<LI>Como funciona (componentes, IDE, circuitos, no&ccedil;&otilde;es de eletricidade)</LI>
		<LI>Linguagem (conceitos, fun&ccedil;&otilde;es e comandos b&aacute;sicos)</LI>
		<LI>Portas digitais</LI>
		<LI>Componentes eletr&ocirc;nicos (LEDs, resistores, protoboard, bot&otilde;es)</LI>
		<LI>Sensores</LI>
		<LI>Exemplos</LI> 
		</UL>
		<p id="paragrafo"><b>Gabriel Alves Vasiljevic Mendes</b> &eacute; formado em Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o e mestrando em Sistemas e Computa&ccedil;&atilde;o pela Universidade Federal do Rio Grande do Norte. Foi bolsista do Programa de Educa&ccedil;&atilde;o Tutorial (PET) e atualmente &eacute; mestrando do PPgSC/DIMAp/UFRN, bolsista do CNPq, desenvolvendo pesquisa com &ecirc;nfase em Interface C&eacute;rebro-Computador.</p>
		<p id="paragrafo"><b>Wanderson Ricardo de Medeiros</b> &eacute; t&eacute;cnico em Informa&aacute;tica pelo Instituto Federal de Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Tecnologia, Campus Central (2009). Aluno do Curso Bacharelado em Ci&ecirc;ncia da Computa&ccedil;&atilde;o pela Universidade Federal do Rio Grande do Norte.</p>
				  
		<h1> Tutorial 4</h1>				  
        <h2>Introdu&ccedil;&atilde;o &agrave; Linguagem Python</h2>
        <p id="paragrafo">Ministrante: Hiago Mayk Gomes de Ara&uacute;jo Rocha</p>
        <p id="paragrafo">Python &eacute; uma poderosa linguagem usada por grandes empresas e organiza&ccedil;&otilde;es como YouTube, Dropbox, Nokia, Yahoo, Google e Nasa. Python &eacute; simples e eficiente, capaz tornar o processo de aprendizagem de programa&ccedil;&atilde;o muito mais f&aacute;cil. Entre outras caracter&iacute;sticas, Python &eacute; orientada a objetos, interpretada, interativa e multiplataforma, tem tipos din&acirc;micos e sintaxe extremamente clara.
 		Para mostrar o potencial desta linguagem, o Workshop DIMAp 30 Anos, em conjunto com o Programa de Educa&ccedil;&atilde;o Tutorial do Curso de Ci&ecirc;ncia da Computa&ccedil;&atilde;o da UFRN, oferecer&aacute; um minicurso introdut&oacute;rio &agrave; programação em Python. Neste minicurso, ser&atilde;o apresentadas informa&ccedil;&otilde;es essenciais e suficientes para iniciar o interessado na cria&ccedil;&atilde;o de programas Python, servindo de ponto de partida para quem deseja trabalhar com esta importante linguagem.</p>


				  
		<h1>Mesa Redonda - Mulheres na Computa&ccedil;&atilde;o:</h1>
		<p id="paragrafo">O comit&ecirc; do Workshop em colabora&ccedil;&atilde;o com alunas do curso de Bacharelado em
		Ci&ecirc;ncia da Computa&ccedil;&atilde;o e o grupo PyLadies Natal est&aacute; organizando um mesa redonda para discutir o tema "Mulheres
		na Computa&ccedil;&atilde;o", levando em considerando a realidade dos cursos de Computa&ccedil;&atilde;o e &aacute;reas afins do RN.</p>
		<p id="paragrafo">A mesa redonda ser&aacute; composta por professoras, professores, alunas e alunos convidados, que
		ir&atilde;o debater o tema durante o Workshop DIMAp 30 anos.</p>
		<p id="paragrafo">Para participar, al&eacute;m de comparecer ao evento, voc&ecirc; tamb&eacute;m poder&aacute; colaborar com a 
		discuss&atilde;o respondendo o question&aacute;rio dispon&iacute;vel em:</p>
		<A HREF="https://goo.gl/OJ3VTM" TARGET="_BLANK">
		<p id="paragrafo">Formul&aacute;rio "Mulheres na Computa&ccedil;&atilde;o - Em busca da realidade local"</p> </A>
		<p id="paragrafo">Sua contribui&ccedil;&atilde;o &eacute; muito importante para n&oacute;s!</p>
	</div>
	</div>
	
	<footer>
         <h3> Em caso de dúvidas ou maiores informações, favor contatar:</h3>
         <h4>dimap30anos@dimap.ufrn.br</h4>
    </footer>
   </div>
</body>
</html>